In [50]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/hyundai/train.csv")
df.head()

,model,year,price,transmission,mileage,fuelType,tax(£),mpg,engineSize
0,Tucson,2016,12795,Manual,36263,Diesel,30,61.7,1.7
1,I10,2012,3995,Manual,22089,Petrol,20,61.4,1.2
2,I30,2019,24000,Manual,555,Petrol,145,34.0,2.0
3,Tucson,2017,12995,Manual,32147,Diesel,30,61.7,1.7
4,Tucson,2018,14991,Semi-Auto,32217,Diesel,150,57.6,1.7

In [51]:
# 정보(row수)가 가장 많은 상위 3차종의 price값의 각 평균값은?

In [52]:
df['model'].value_counts()

model
Tucson      1049
I10          863
I30          432
I20          398
Kona         266
Ioniq        228
Santa Fe     193
IX20         157
I40          105
I800          97
IX35          89
Getz           5
Veloster       3
Accent         1
Terracan       1
Amica          1
Name: count, dtype: int64

In [53]:
cond1 = df['model'].str.contains('Tucson')
cond2 = df['model'].str.contains('I10')
cond3 = df['model'].str.contains('I30')

df_result = df.loc[cond1 | cond2 | cond3]

df_result.groupby('model')['price'].mean().to_frame()

               price
model
I10      7646.137891
I30     11651.821759
Tucson  15805.441373

In [56]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/diabetes/train.csv")
df.head()

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,3,102,74,0,0,29.5,0.121,32,0
1,2,144,58,33,135,31.6,0.422,25,1
2,5,136,82,0,0,0.0,0.640,69,0
3,13,145,82,19,110,22.2,0.245,57,0
4,1,117,60,23,106,33.8,0.466,27,0

In [57]:
# Question 102 Outcome 값에 따른 각 그룹의 각 컬럼의 평균 차이를 구하여라

In [78]:
result = df.groupby('Outcome').mean().reset_index()
result[result['Outcome'] == 1].mean() - result[result['Outcome'] == 0].mean()

Outcome                      1.000000
Pregnancies                  1.574159
Glucose                     29.943995
BloodPressure                3.202079
SkinThickness                2.952033
Insulin                     33.398645
BMI                          4.541437
DiabetesPedigreeFunction     0.143646
Age                          5.866939
dtype: float64

In [79]:
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/nflx/NFLX.csv")
df.head()

         Date      Open      High       Low     Close  Adj Close     Volume
0  2002-05-23  1.156429  1.242857  1.145714  1.196429   1.196429  104790000
1  2002-05-24  1.214286  1.225000  1.197143  1.210000   1.210000   11104800
2  2002-05-28  1.213571  1.232143  1.157143  1.157143   1.157143    6609400
3  2002-05-29  1.164286  1.164286  1.085714  1.103571   1.103571    6757800
4  2002-05-30  1.107857  1.107857  1.071429  1.071429   1.071429   10154200

In [80]:
# 매년 5월달의 open가격의 평균값을 데이터 프레임으로 표현하라

In [82]:
df['Date'] = pd.to_datetime(df['Date'])

In [88]:
df['month'] = df['Date'].dt.month

In [109]:
df['month_day'] = df['Date'].dt.to_period('M')

In [114]:
result = df[df['month'] == 5]
result.groupby('month_day')['Open'].mean().to_frame()

                 Open
month_day
2002-05      1.155833
2003-05      1.641497
2004-05      4.261143
2005-05      1.951905
2006-05      4.163571
2007-05      3.159351
2008-05      4.435034
2009-05      5.790571
2010-05     14.417071
2011-05     34.650272
2012-05     10.523247
2013-05     31.936429
2014-05     51.121292
2015-05     85.057429
2016-05     92.705715
2017-05    158.255455
2018-05    329.779541
2019-05    359.664548
2020-05    433.880499
2021-05    496.923996

In [115]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/nba/nba.csv",encoding='latin',sep=';')
df.head()

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
0,1,Precious Achiuwa,C,22,TOR,73,28,23.6,3.6,8.3,...,0.595,2.0,4.5,6.5,1.1,0.5,0.6,1.2,2.1,9.1
1,2,Steven Adams,C,28,MEM,76,75,26.3,2.8,5.1,...,0.543,4.6,5.4,10.0,3.4,0.9,0.8,1.5,2.0,6.9
2,3,Bam Adebayo,C,24,MIA,56,56,32.6,7.3,13.0,...,0.753,2.4,7.6,10.1,3.4,1.4,0.8,2.6,3.1,19.1
3,4,Santi Aldama,PF,21,MEM,32,0,11.3,1.7,4.1,...,0.625,1.0,1.7,2.7,0.7,0.2,0.3,0.5,1.1,4.1
4,5,LaMarcus Aldridge,C,36,BRK,47,12,22.3,5.4,9.7,...,0.873,1.6,3.9,5.5,0.9,0.3,1.0,0.9,1.7,12.9

In [116]:
# Tm 컬럼은 각 팀의 이름을 의미한다. TOR팀의 평균나이를 소수 4째 자리까지 구하여라

In [120]:
round(df[df['Tm'] == 'TOR']['Age'].mean(),4)

np.float64(24.8696)

In [121]:
# Pos 컬럼은 포지션을 의미한다. 
#전체 선수 중 최소나이대의 선수들을 필터하고 그들 중 가장 많은 포지션은 무엇인지 확인하라

In [125]:
df['Age'].value_counts()

Age
24    104
23     81
22     73
26     68
25     65
28     60
27     53
29     50
21     48
31     42
30     33
20     31
32     29
33     23
35     14
19     13
34     11
36      9
37      2
41      1
38      1
40      1
Name: count, dtype: int64

In [127]:
df[df['Age'] == 19]['Pos'].value_counts()

Pos
SG    9
PF    2
SF    1
C     1
Name: count, dtype: int64

In [128]:
# 선수들의 이름은 first_name+ 공백 + last_name으로 이루어져 있다. 
#가장 많은 first_name은 무엇이며 몇 회 발생하는지 확인하라

In [147]:
df['Player_first'] = df['Player'].str.split(' ').str[0]

In [148]:
df['Player_last'] = df['Player'].str.split(' ').str[1]

In [150]:
df['Player_first'].value_counts()

Player_first
Justin     14
Josh       13
Isaiah     11
James       9
Jalen       8
           ..
Trendon     1
Lindy       1
Yuta        1
Duane       1
Omer        1
Name: count, Length: 448, dtype: int64

In [151]:
# PTS컬럼은 경기당 평균득점수 이다. 각포지션별로 경기당 평균득점수의 평균을 구하여라

In [157]:
df.groupby('Pos')['PTS'].mean().to_frame().sort_values('PTS')

             PTS
Pos
SF      7.270253
SG-SF   7.360000
C       7.690769
PF      7.737500
SG      7.810553
PG      8.325161
PF-SF   8.500000
SF-SG   8.660000
SG-PG   9.525000
C-PF   12.850000
PG-SG  22.000000

In [158]:
# G컬럼은 참여한 경기의 숫자이다. 각 팀별로 가장 높은 경기참여 수를 가진 선수들의 경기 참여 숫자의 평균을 구하여라

In [165]:
df.sort_values(['Tm','G']).groupby('Tm').tail(1)['G'].mean()

np.float64(77.51612903225806)

In [168]:
# Tm의 값이 MIA이며 Pos는 C또는 PF인 선수의 MP값의 평균은?

In [177]:
cond1 = df['Tm'] == 'MIA' 
result = df.loc[cond1]
cond2 = result['Pos'] == 'C'
cond3 = result['Pos'] == 'PF'

result = result.loc[cond2 | cond3]
result['MP'].mean()

np.float64(16.7875)

In [178]:
# 전체 데이터중 G의 평균값의 1.5배 이상인 데이터들만 추출했을때 3P값의 평균은?

In [181]:
df[df['G'] >= df['G'].mean()* 1.5]['3P'].mean()

np.float64(1.3853658536585365)

In [182]:
# Age의 평균 이상인 그룹과 평균 미만인 그룹간의 G값의 평균의 차이는?

In [183]:
df[df['Age'] >= df['Age'].mean()]['G'].mean() - df[df['Age'] <= df['Age'].mean()]['G'].mean()

np.float64(3.787674551781862)

In [184]:
# 평균나이가 가장 젊은 팀은 어디인가

In [195]:
df.groupby('Tm')['Age'].mean().sort_values()

Tm
MEM    23.782609
OKC    23.807692
DET    24.111111
ORL    24.500000
HOU    24.526316
MIN    24.555556
TOR    24.869565
CHO    24.947368
POR    25.000000
SAC    25.230769
CHI    25.272727
SAS    25.333333
NYK    25.652174
WAS    25.724138
NOP    25.727273
IND    25.892857
ATL    25.958333
CLE    26.076923
PHI    26.391304
DEN    26.454545
BOS    26.500000
DAL    26.592593
LAC    26.826087
PHO    26.869565
TOT    26.876289
UTA    27.250000
MIL    27.344828
GSW    27.411765
MIA    27.500000
BRK    28.541667
LAL    29.080000
Name: Age, dtype: float64

In [196]:
# Pos그룹별 평균 MP값을 구하여라

In [197]:
df.groupby('Pos')['MP'].mean()

Pos
C        16.990000
C-PF     25.350000
PF       17.937500
PF-SF    27.300000
PG       19.547742
PG-SG    37.200000
SF       17.514557
SF-SG    20.340000
SG       18.554271
SG-PG    22.950000
SG-SF    19.620000
Name: MP, dtype: float64